ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/alarm.c
/**
 * @file    alarm.c
 * @brief   Zvukovy alarm na SIGNAL_LOST + ztratu GPS locku. Viz alarm.h.
 *
 * Model: alarm_tick() (~100 Hz z defaultTask) sleduje dva stavy a hlida jejich
 * PRECHOD (edge). Ztrata (OK->chyba) spusti pattern 3 kratkych pipnuti, obnoveni
 * (chyba->OK) jedno delsi. Pattern se prehrava neblokujicne pres HAL_GetTick.
 * Globalni mute (g_sound_muted) okamzite umlci vse.
 *
 * Boot bez falesneho alarmu: FPGA link i GPS lock zacinaji jako "jeste nikdy
 * nebyly OK" -> zadna hrana OK->chyba pri startu (alarm az kdyz link/lock ozije
 * a pak spadne).
 */
#include "alarm.h"
#include "beeper.h"
#include "gps.h"
#include "meas_math.h"       /* g_meas_verdict + g_meas_cfg — limit pass/fail alarm (#44) */
#include "stm32h7xx_hal.h"

/* Sdilene stavy (definice ve freertos.c). */
extern volatile unsigned char g_freq_stale;    /* 1 = FPGA signal lost / mrtvy link */
extern volatile unsigned char g_sound_muted;   /* 1 = globalni mute (Nastaveni) */

/* Pocitadla udalosti pro okno Alarmy (definice zde, extern v alarm.h). */
volatile unsigned int g_alarm_fpga_lost  = 0;  /* pocet ztrat FPGA signalu */
volatile unsigned int g_alarm_gps_lost   = 0;  /* pocet ztrat GPS locku */
volatile unsigned int g_alarm_limit_fail = 0;  /* pocet prechodu PASS->FAIL limitu (#44) */

/* ── Neblokujici prehravac patternu (sekvence ON/OFF pulzu) ── */
static unsigned char  s_pulses_left;   /* zbyva ON pulzu */
static unsigned short s_on_ms, s_off_ms;
static unsigned char  s_phase;         /* 0 idle, 1 ON, 2 OFF */
static unsigned int   s_phase_until;   /* HAL_GetTick() konce faze */

static void pattern_start(unsigned char pulses, unsigned short on_ms, unsigned short off_ms)
{
    s_pulses_left = pulses;
    s_on_ms = on_ms;
    s_off_ms = off_ms;
    s_phase = 1;
    s_phase_until = HAL_GetTick() + on_ms;
    beeper_set(true);
}

static void pattern_stop(void)
{
    s_phase = 0;
    s_pulses_left = 0;
    beeper_set(false);
}

static void pattern_service(void)
{
    if (s_phase == 0) return;
    unsigned int now = HAL_GetTick();
    if (s_phase == 1) {                      /* ON dobehl? */
        if ((int)(now - s_phase_until) < 0) return;
        beeper_set(false);
        if (--s_pulses_left == 0) { s_phase = 0; return; }
        s_phase = 2;
        s_phase_until = now + s_off_ms;
    } else {                                 /* OFF dobehl? -> dalsi ON */
        if ((int)(now - s_phase_until) < 0) return;
        beeper_set(true);
        s_phase = 1;
        s_phase_until = now + s_on_ms;
    }
}

/* ── Vyhodnoceni stavu + hranove spousteni ── */
static unsigned char s_fpga_bad_prev = 1;    /* boot = predpokladej mrtvy link (zadna OK->bad hrana) */
static unsigned char s_fpga_ever = 0;        /* uz nekdy byl link OK (jinak start tichy) */
static unsigned char s_gps_lock_prev = 0;    /* boot = jeste nikdy zamknuto */
static unsigned char s_gps_ever = 0;         /* uz nekdy byl lock (jinak neresime jeho ztratu) */
static unsigned char s_meas_fail_prev = 0;   /* limit FAIL v predchozim vyhodnoceni */
static unsigned char s_meas_ever = 0;        /* uz nekdy byl PASS (jinak: zapnuti limitu na spatne hodnote nepipne) */

/* Touch click: UiTask jen nastavi flag, prehraje ho alarm_tick (jeden vlastnik
 * pattern stavu = defaultTask -> zadny cross-task zapis do s_phase). */
static volatile unsigned char s_click_req;
void alarm_click(void) { s_click_req = 1; }

void alarm_tick(void)
{
    /* Mute: umlci okamzite (i rozehrany pattern). */
    if (g_sound_muted && (s_phase != 0 || beeper_is_on())) pattern_stop();
    /* Presne casovani pipnuti — kazdy tik (~100 Hz), jen kdyz neni mute. */
    if (!g_sound_muted) pattern_service();

    /* Touch click (~12 ms tick @800 Hz): jen kdyz nehraje alarm pattern. */
    if (s_click_req) {
        s_click_req = 0;
        if (!g_sound_muted && s_phase == 0) pattern_start(1, 12, 0);
    }

    /* Vyhodnoceni stavu (hrany) jen 5x/s — gps_get kopiruje ~200B v kriticke sekci. */
    static unsigned int last_eval;
    unsigned int now = HAL_GetTick();
    if ((now - last_eval) < 200u) return;
    last_eval = now;

    gps_data_t g; gps_get(&g);
    unsigned char fpga_bad = g_freq_stale ? 1 : 0;
    unsigned char lock = (g.valid || g.fix_mode >= 2) ? 1 : 0;
    /* Limit pass/fail (#44): aktivni jen kdyz limity i alarm zapnute. FAIL = LO|HI.
     * s_meas_ever se armuje jen skutecnym PASS -> zapnuti limitu na uz spatne
     * hodnote nezpusobi pipnuti (az prechod PASS->FAIL). Vypnuti limitu resetuje. */
    unsigned char meas_active = (g_meas_cfg.limit_en && g_meas_cfg.alarm_en) ? 1 : 0;
    unsigned char meas_fail = (g_meas_verdict == MEAS_LO || g_meas_verdict == MEAS_HI) ? 1 : 0;

    if (g_sound_muted) {
        /* drz prev stavy aktualni, aby po odmuteni nepipl na starou (davno proslou) hranu */
        if (!fpga_bad) s_fpga_ever = 1;
        s_fpga_bad_prev = fpga_bad;
        if (lock) s_gps_ever = 1;
        s_gps_lock_prev = lock;
        if (!meas_active) { s_meas_fail_prev = 0; s_meas_ever = 0; }
        else { if (g_meas_verdict == MEAS_PASS) s_meas_ever = 1; s_meas_fail_prev = meas_fail; }
        return;
    }

    /* FPGA signal: prvni link-up po startu je TICHY (s_fpga_ever), pak OK->lost =
     * alarm (3 pipnuti), lost->OK = 1 pipnuti (obnoveni). */
    if (!fpga_bad && s_fpga_bad_prev) {
        if (s_fpga_ever) pattern_start(1, 150, 0);   /* obnoveni (ne prvni link-up) */
        s_fpga_ever = 1;
    } else if (fpga_bad && !s_fpga_bad_prev && s_fpga_ever) {
        pattern_start(3, 80, 80);                    /* ztrata signalu */
        g_alarm_fpga_lost++;                         /* pocitadlo pro okno Alarmy */
    }
    s_fpga_bad_prev = fpga_bad;

    /* GPS lock: ztrata jen kdyz uz nekdy byl (bench bez anteny se nikdy nezamkne). */
    if (lock && !s_gps_lock_prev) {
        if (s_gps_ever) pattern_start(1, 150, 0);   /* re-lock potvrzeni (ne pri prvnim) */
        s_gps_ever = 1;
    } else if (!lock && s_gps_lock_prev && s_gps_ever) {
        pattern_start(2, 120, 120);                 /* ztrata locku */
        g_alarm_gps_lost++;                         /* pocitadlo pro okno Alarmy */
    }
    s_gps_lock_prev = lock;

    /* Limit pass/fail: PASS->FAIL = 4 pipnuti, FAIL->PASS = 1 (obnoveni). */
    if (!meas_active) {
        s_meas_fail_prev = 0; s_meas_ever = 0;      /* vypnuto -> zadna hrana pri pristim zapnuti */
    } else {
        if (meas_fail && !s_meas_fail_prev && s_meas_ever) {
            pattern_start(4, 70, 70);               /* mimo meze */
            g_alarm_limit_fail++;
        } else if (!meas_fail && s_meas_fail_prev) {
            pattern_start(1, 150, 0);               /* zpet v mezich */
        }
        if (g_meas_verdict == MEAS_PASS) s_meas_ever = 1;   /* arm jen realnym PASS */
        s_meas_fail_prev = meas_fail;
    }
}

void alarm_test(void)
{
    pattern_start(2, 100, 100);
}
